<script setup>
import { ref } from 'vue'
import SearchUser from './components/SearchUser/index.vue'
import SearchColumn from './components/SearchColumn/index.vue'
import SearchDiscuss from './components/SearchDiscuss/index.vue'
import SearchSeek from './components/SearchSeek/index.vue'
import SearchAll from './components/SearchAll/index.vue'
import SliderRecommendCard from './base/slider-recommend-card/index.vue'

const handleTabChange = (name) => {
  console.log(name)
}

const itemList = [
  {
    id: '1',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: true
  },
  {
    id: '2',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '3',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '4',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '5',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '6',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '6',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '6',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '6',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '6',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '8',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '9',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '10',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '11',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '12',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  },
  {
    id: '13',
    userName: '一小池勺',
    avaterPic: 'https://pic.imgdb.cn/item/65d03adf9f345e8d03e6f352.jpg',
    title: '如何评价贾玲在电影《热辣滚烫》中的表现？',
    desc: '为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。为什么评论区的大家会信，总觉得有什么科技狠活或者神秘力量，例如饮食团队，教练团队，或者一天锻炼八小时。这东西就是拔苗助长，肌肉生成是需要时间的。有健身减肥经验的朋友都知道，你减肥期间，力量不掉就不错了。有的人一吃少了，练原来的重量都费劲。她一年减重100斤，同时完成硬拉120公斤，我只能说天赋应该进国家队。中国所有的学生，成年人，都缺少了逻辑学。什么是逻辑学，例如我不吃中药会有什么正作用？副作用？我吃呢？有什么正作用，有副作用？有没有替代？生物科学领域的专家们，他们是如何思考的，如何吃的？屠呦呦生病了，会吃中成药还是西药？你这么一推理后，突然给了自己两巴掌，愚蠢，愚昧，豁然开朗。',
    commentNums: 12,
    like: false
  }
]

const userList = ref([{ name: 1 }, {}, {}])
</script>

<template>
  <div class="search-detail">
    <div class="detail--left">
      <el-tabs tab-position="top" @tab-change="handleTabChange">
        <el-tab-pane label="全站">
          <SearchAll :itemList="itemList"></SearchAll>
        </el-tab-pane>
        <el-tab-pane label="用户">
          <search-user></search-user>
        </el-tab-pane>
        <el-tab-pane label="讨论">
          <SearchDiscuss></SearchDiscuss>
        </el-tab-pane>
        <el-tab-pane label="专栏">
          <SearchColumn></SearchColumn>
        </el-tab-pane>
        <el-tab-pane label="求助">
          <SearchSeek></SearchSeek>
        </el-tab-pane>
      </el-tabs>
    </div>
    <div class="detail--right">
      <el-affix :offset="100">
        <div class="user">
          <SliderRecommendCard :data="userList" title="体验官推荐">
            <template #headerRight>
              <span>换一批推荐官</span>
              <el-icon>
                <Refresh />
              </el-icon>
            </template>
            <template #default="slotProps">
              <SearchUser v-for="item in slotProps"></SearchUser>
            </template>
          </SliderRecommendCard>
        </div>

        <div class="topic">
          <SliderRecommendCard :data="userList" title="猜你感兴趣">
            <template #default="slotProps">
              <SearchColumn v-for="item in slotProps"></SearchColumn>
            </template>
          </SliderRecommendCard>
        </div>
      </el-affix>
    </div>
    <el-backtop :right="100" :bottom="100" />
  </div>
</template>

<style scoped lang="scss">
.search-detail {
  width: 80vw;
  margin: 20px auto;
  display: flex;

  .detail--left {
    flex: 8;
  }

  .detail--right {
    flex: 2;
    height: 100px;
    margin-top: 40px;
    margin-left: 30px;
    white-space: nowrap;

    .user {
      margin-bottom: 30px;

      span {
        padding-right: 10px;
        font-weight: 100;
        font-size: 12px;
      }
    }

    .topic {
    }
  }

  .infinite-list {
    height: 100vh;
    padding: 0;
    margin: 0;
    list-style: none;
  }

  .infinite-list .infinite-list-item {
    display: flex;
    align-items: center;
    justify-content: center;
    height: 50px;
    background: var(--el-color-primary-light-9);
    margin: 10px;
    color: var(--el-color-primary);
  }

  .infinite-list .infinite-list-item + .list-item {
    margin-top: 10px;
  }
}

@media (max-width: 768px) {
  .detail--right {
    display: none;
  }
  .detail--left {
    flex: 8;
  }
}
</style>
